*Importing pandas.*

In [1]:
import pandas as pd

*Loading the dataset.*

In [2]:
df_movies = pd.read_csv('User_Movie_Ratings.csv', index_col = 'User')

df_cars = pd.read_csv('carprices.csv', index_col = None)

buffet_data = pd.read_csv('Buffet_Details.csv')

*Accesses the ratings of the movies ‘Thor’, ‘Spiderman’, and ‘Insidious’ from the df_movies dataframe?*

In [3]:
df_movies.columns

Index(['Thor', 'Justice League', 'Spiderman', 'The Notebook', 'Casablanca',
       'Beauty and the Beast', 'Dolittle', 'The Kissing Booth', 'Annabelle',
       'Insidious'],
      dtype='object')

In [4]:
df_movies[['Thor', 'Spiderman','Insidious']]

           Thor  Spiderman  Insidious
User
Arnold        6          6          1
Ben           9          8          8
Catherine    10          9          9
Disha         6          7          6
Euclid        7          3          7
Farhaan       6          9          4
Gaurav        8          9          7
Hilbert       6          8          1
Indira       10          9          8
Jason        10          9          4
Kenny         3          5          3
Lambert       5          4          9
Manish        7          6          5
Niti          3          2          5
Oliver        4          4          2
Pranav        8          8          7
Qader         8          8          5
Ravi          8          9         10
Sushant       5          6          5
Tavneet       1          4          5

*Which car's information is stored in the 78th row of the `df_cars` dataframe?*

In [5]:
df_cars.iloc[77]['carname']

'mitsubishi lancer'

*How can we retrieve the rating ‘Indira’ gave to the movie ‘Annabelle’ in the df_movies dataframe?*

In [6]:
df_movies.head(n=3)

,Thor,Justice League,Spiderman,The Notebook,Casablanca,Beauty and the Beast,Dolittle,The Kissing Booth,Annabelle,Insidious
User,,,,,,,,,,
Arnold,6,5,6,4,5,4,9,8,2,1
Ben,9,10,8,3,1,1,2,5,7,8
Catherine,10,8,9,5,6,7,8,5,9,9

In [7]:
print (f"Rating given by Indria to the movie Annabelle: {df_movies.loc["Indira","Annabelle"]}")

Rating given by Indria to the movie Annabelle: 6

*Write the Pandas code to select the rows for `Manish and Ravi`, but only the columns from `Thor through Spiderman`.*

In [8]:
df_movies.loc[['Manish', 'Ravi'], 'Thor':'Spiderman']

        Thor  Justice League  Spiderman
User
Manish     7               6          6
Ravi       8               7          9

*How can you determine the number of sedans in the df_cars dataframe?*

In [9]:
df_cars[df_cars['carbody'] == 'sedan'].shape[0]

96

In [10]:
len(df_cars[df_cars['carbody'] == 'sedan'])

96

*Let’s say you want to know how many users in the df_movies dataframe rated more than 7 for Thor and Spiderman but rated 7 or less for Dolittle.*

In [11]:
df_movies.info()

<class 'pandas.core.frame.DataFrame'>
Index: 20 entries, Arnold to Tavneet
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Thor                  20 non-null     int64
 1   Justice League        20 non-null     int64
 2   Spiderman             20 non-null     int64
 3   The Notebook          20 non-null     int64
 4   Casablanca            20 non-null     int64
 5   Beauty and the Beast  20 non-null     int64
 6   Dolittle              20 non-null     int64
 7   The Kissing Booth     20 non-null     int64
 8   Annabelle             20 non-null     int64
 9   Insidious             20 non-null     int64
dtypes: int64(10)
memory usage: 2.3+ KB

In [12]:
df_movies [(df_movies['Thor'] > 7) & (df_movies['Spiderman'] > 7) & (df_movies['Dolittle'] <= 7)][['Thor','Spiderman','Dolittle']].shape[0]

6